---
Title: ' iosでLINE風味にIRBできるようにする'
Category:
- diary
Date: 2016-04-13T23:46:08+09:00
URL: https://ongaeshi.hatenablog.com/entry/2016/04/13/234608
EditURL: https://blog.hatena.ne.jp/tuto0621/ongaeshi.hatenablog.com/atom/entry/10328537792371050889
---

[Qiita](http://qiita.com/ongaeshi/items/23c21d1baebe013dffbd) から引っ越し。

次のバージョンの[PictRuby](http://pictruby.ongaeshi.me/)でチャット風インターフェースを作れるようにしたのでirbを実装した。

<img width="480" alt="pictruby-irb-01.png" src="https://qiita-image-store.s3.amazonaws.com/0/3885/dd4affc9-d711-c4b2-401b-a8216fddc415.png">

コードは以下のような感じに。エラーハンドリングはさすがにObjective-C側に書かないとダメかなと思ったいたのだけど、例外キャッチするだけでうまくいった。Rubyの表現力はやはり高い。

```ruby
# # 10_irb
#
# ## Description
# Interactive Ruby Shell is a REPL.

def chat(input)
  begin
    eval(input)
  rescue Exception => e
    e.message
  end
end
```

とりあえずうまくいったのだけど、なぜかローカル変数を定義できないので他のirbの実装を眺めてみた。

<img width="400" alt="pictruby-irb-02.png" src="https://qiita-image-store.s3.amazonaws.com/0/3885/b4cac003-ed06-917b-58ae-b0999e57a56c.png">

## web-irb
http://joshnuss.github.io/mruby-web-irb/

```
>> a = [1, 2, 3]
=>[1, 2, 3]
=>NoMethodError: undefined method 'a' for main
```

同じ現象が起きている！

```
>> @a = [1, 2, 3]
>> @a
=>[1, 2, 3]
```

メンバ変数として定義するとちゃんと保持される。

## mirbiosでLINE風味にIRBできるようにする

次のバージョンの[PictRuby](http://pictruby.ongaeshi.me/)でチャット風インターフェースを作れるようにしたのでirbを実装した。

<img width="480" alt="pictruby-irb-01.png" src="https://qiita-image-store.s3.amazonaws.com/0/3885/dd4affc9-d711-c4b2-401b-a8216fddc415.png">

コードは以下のような感じに。エラーハンドリングはさすがにObjective-C側に書かないとダメかなと思ったいたのだけど、例外キャッチするだけでうまくいった。Rubyの表現力はやはり高い。

```ruby
# # 10_irb
#
# ## Description
# Interactive Ruby Shell is a REPL.

def chat(input)
  begin
    eval(input)
  rescue Exception => e
    e.message
  end
end
```

とりあえずうまくいったのだけど、なぜかローカル変数を定義できないので他のirbの実装を眺めてみた。

<img width="400" alt="pictruby-irb-02.png" src="https://qiita-image-store.s3.amazonaws.com/0/3885/b4cac003-ed06-917b-58ae-b0999e57a56c.png">

## web-irb
http://joshnuss.github.io/mruby-web-irb/

```
>> a = [1, 2, 3]
=>[1, 2, 3]
=>NoMethodError: undefined method 'a' for main
```

同じ現象が起きている！

```
>> @a = [1, 2, 3]
>> @a
=>[1, 2, 3]
```

メンバ変数として定義するとちゃんと保持される。

## mirb

mruby標準添付のやつ

```
$ git clone https://github.com/mruby/mruby.git
$ rake
$ ./bin/mirb 
mirb - Embeddable Interactive Ruby Shell

> a = 1
a = 1
 => 1
> a
a
 => 1
```

mirbはちゃんとローカル変数が使えるようだ。何か実際に違いがあるのかも。(そのうちソース読もう)

## まとめ

ともあれweb-irbは同じだったのでちょっと安心した(なにが)。メンバ変数を使うという逃げ道も見つかったのでとりあえず実装優先で進める。


mruby標準添付のやつ

```
$ git clone https://github.com/mruby/mruby.git
$ rake
$ ./bin/mirb 
mirb - Embeddable Interactive Ruby Shell

> a = 1
a = 1
 => 1
> a
a
 => 1
```

mirbはちゃんとローカル変数が使えるようだ。何か実際に違いがあるのかも。(そのうちソース読もう)

## まとめ

ともあれweb-irbは同じだったのでちょっと安心した(なにが)。メンバ変数を使うという逃げ道も見つかったのでとりあえず実装優先で進める。
